/*
 * 平台机构职能模块
 */

// 获取回应关切表格接口
export function getDeptDescIntroductionData() {
    const deptDescIntroductionData = {
        "code": 200,
        "msg": null,
        "data": {
            dept_name:'党政综合办公室',
            introduction_content:'<h1 style="text-align: center;"><span style="color: rgb(28, 72, 127);">某某镇党政综合办公室机构职责</span></h1><div><p><strong>【主要职责】</strong></p><p>(一)贯彻执行党的路线、方针、政策以及省委、省政府和肇庆市委、市政府的决策和决定,贯彻落实市委、市政府的工作部署。</p><p>(二)检查和督促落实市政府各项决议、决定、重要工作部署和市政府领导同志重要批示,向市政府领导报告工作的落实情况。</p><p>(三)处理各级政府、各部门报送市政府和市政府办公室的文电,审核、草拟和制发以市政府和市政府办公室名义发布的文件,报送信息资料。</p><p>(四)组织或参与全市经济社会发展重大问题调查研究，负责市政府工作情况汇报材料、重要会议的会议材料和市政府重大活动的组织安排。</p><p>(五)根据市政府领导同志批示,组织协调市政府有关部门以及省和市驻我镇单位的关系。</p><p>(六)负责市政府政务信息、网络问政和重大措施及重要政务活动宣传等工作。</p><p>(七)承担市政府总值班室工作，办理向市政府报送的紧急重要事项，指导全市政府系统值班工作；协助市政府领导同志组织处理需由市政府组织处理的突发事件和重大事故,协调、督促相关处置工作。</p><p>(八)负责统筹推进转变政府职能及放管服相关工作。</p><p>(九)组织办理人大代表议案、建议及政协提案。</p><p><br></p><p><br></p><p><br></p><p>某某镇党政综合办公室联系电话：020-3141592</p></div>',
            leaderData:[
                {
                    id:1,
                    image: require("/src/assets/leader_myself_3x4.jpg"),
                    name: '林俊杰',
                    description:'<h4>某某镇人民政府党组成员，镇政府办公厅党组书记、主任</h4><div>基本信息：男，汉族，某某市某某镇人，1900年1月出生，2000年5月参加工作，大学毕业，软件工程学士。</div>',
                },
                {
                    id:2,
                    image: require("/src/assets/leader_myself_3x4.jpg"),
                    name: '林俊杰',
                    description:'<h4>某某镇人民政府党组成员，镇政府办公厅党组书记、主任</h4><div>基本信息：男，汉族，某某市某某镇人，1900年1月出生，2000年5月参加工作，大学毕业，软件工程学士。</div>',
                },
                {
                    id:3,
                    image: require("/src/assets/leader_myself_3x4.jpg"),
                    name: '林俊杰',
                    description:'<h4>某某镇人民政府党组成员，镇政府办公厅党组书记、主任</h4><div>基本信息：男，汉族，某某市某某镇人，1900年1月出生，2000年5月参加工作，大学毕业，软件工程学士。</div>',
                },
                {
                    id:4,
                    image: require("/src/assets/leader_myself_3x4.jpg"),
                    name: '林俊杰',
                    description:'<h4>某某镇人民政府党组成员，镇政府办公厅党组书记、主任</h4><div>基本信息：男，汉族，某某市某某镇人，1900年1月出生，2000年5月参加工作，大学毕业，软件工程学士。</div>',
                },
                {
                    id:5,
                    image: require("/src/assets/leader_myself_3x4.jpg"),
                    name: '林俊杰',
                    description:'<h4>某某镇人民政府党组成员，镇政府办公厅党组书记、主任</h4><div>基本信息：男，汉族，某某市某某镇人，1900年1月出生，2000年5月参加工作，大学毕业，软件工程学士。</div>',
                },
            ],
            dept_setting_desc:'<h1 style="text-align: center;"><span style="color: rgb(28, 72, 127);">机构设置</span></h1><div><p>市政府办公厅设下列内设机构:</p><p>(一)办公室。负责机关政务及事务管理协调工作。负责镇政府办公厅党组及领导服务保障工作。负责机关日常运转工作，承担文电、会务等工作。承担镇政府办公厅信息、信息公开及建议议案提案办理等工作。承担重要事项的组织和督查工作。</p><p>(二)秘书一至六处。负责镇政府有关方面的文电办理工作。负责镇政府有关领导同志会议的组织协调和交办事项的联络服务工作，以及有关事项的督查工作。</p><p>(三)机要保密处。负责镇政府机关机要文件交换工作。负责文电接收、分办、运转、分发工作。负责档案归档、管理、利用工作。负责印鉴管理工作。负责机关保密工作。</p><p>(四)值班室。负责指导、监督、检查镇政府系统的值守工作，及时报告重要情况，传达和督促落实市政府领导同志指示。服务镇政府领导指挥处置突发事件等相关工作。</p><p>(五)会议处。负责市政府党组服务保障工作。负责镇政府全体会议、镇政府常务会议、镇政府专题会议的会务工作，以及会议决定事项的督查工作。负责以镇政府名义召开会议的组织工作。</p><p>(六)联络处。负责联系人大、政协有关工作。负责组织协调镇政府部门办理人大代表议案、建议和政协建议案、提案。</p><p>(七)财务处。承担机关及所属单位的财务工作。负责部门预决算编制及日常核算管理。组织实施内部审计及财务监督。<br></p><p>(八)人事处。负责机关及所属单位的人事管理、机构编制、队伍建设、教育培训及外事等工作。</p></div>',
            user:{ userRole:2},
        }
    };
    return {
        url: 'api/DeptDescIntroduction',
        type: 'get',
        data: deptDescIntroductionData
    }
}
